In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [13]:
import pandas as pd

# Try common encodings (most likely one will work)
encodings = ['latin1', 'iso-8859-1', 'cp1252', 'utf-16']

for encoding in encodings:
    try:
        df = pd.read_csv('IT.csv', encoding=encoding)
        print(f"Success with {encoding}")
        break
    except UnicodeDecodeError:
        continue

Success with latin1

In [27]:
df.info

<bound method DataFrame.info of        EEID      Full Name             Job Title Department  \
0    E03247    Aaliyah Mai        Vice President         IT
1    E04888   Elijah Henry               Manager         IT
2    E02216  Caleb Marquez  IT Systems Architect         IT
3    E02861   Daniel Perry  Enterprise Architect         IT
4    E04972      Sophie Oh      Network Engineer         IT
..      ...            ...                   ...        ...
277  E04670       Angel Do  IT Systems Architect         IT
278  E02888   Elijah Ramos            Sr. Manger         IT
281   E2001       John Doe            IT Analyst         IT
282   E2006      Lisa Chen     Software Engineer         IT
283   E2009  Michael Brown        Data Scientist         IT

              Business Unit  Gender  Ethnicity  Age   Hire Date Annual Salary  \
0       Speciality Products  Female      Asian   57  11/11/2016     $246,589
1                 Corporate    Male  Caucasian   32    1/3/2014     $127,148
2    Research & Development    Male     Latino   29  10/15/2019      $66,819
3    Research & Development    Male  Caucasian   62   4/15/2001      $80,921
4                 Corporate  Female      Asian   29   11/9/2017      $63,985
..                      ...     ...        ...  ...         ...           ...
277     Speciality Products    Male      Asian   34   9/20/2019      $94,735
278     Speciality Products    Male     Latino   33  12/24/2012     $132,544
281                     NaN    Male        NaN   29   3/15/2020         55000
282                     NaN  Female        NaN   25   2/10/2023         68000
283                     NaN    Male        NaN   33  10/15/2019         78000

     Bonus %        Country            City   ExitDate  EmploymentRating  \
0       0.33  United States         Phoenix  3/26/2017                 7
1       0.10  United States           Miami        NaN                 7
2       0.00         Brazil  Rio de Janerio        NaN                 7
3       0.00  United States        Columbus        NaN                 5
4       0.00  United States           Miami        NaN                 8
..       ...            ...             ...        ...               ...
277     0.00          China       Beijing          NaN                10
278     0.10         Brazil  Rio de Janerio        NaN                 9
281     5.00            UAE           Dubai        NaN                 4
282     9.00         Canada         Toronto        NaN                 5
283     8.00            UAE           Dubai  3/10/2023                 5

     DaysOfAbsence EducationLevel  CertificationsEarned
0               16     Bachelor's                     0
1               16       Master's                     1
2               16     Bachelor's                     2
3               16     Bachelor's                     1
4               16     Bachelor's                     3
..             ...            ...                   ...
277              0            PhD                     3
278              0     Bachelor's                     2
281              3       Bachelor                     2
282              0       Bachelor                     3
283              1         Master                     4

[236 rows x 18 columns]>

In [17]:
print(df['EEID'].isna().sum())

0

In [25]:
print(df['EEID'].duplicated().sum())
df.drop_duplicates(subset=['EEID'], keep='first', inplace=True)
print(df['EEID'].duplicated().sum())

48
0

In [93]:
print(df['Full Name'].isna().sum())
print(df['Full Name'].duplicated().sum())
df.drop_duplicates(subset=['Full Name'], keep='first', inplace=True)
print(df['Full Name'].duplicated().sum())

0
0
0

In [95]:
df['Annual Salary'] = (
    df['Annual Salary']
    .str.replace('$', '', regex=False)
    .str.replace(',', '')
    .str.strip()
    .astype(float)
)

In [ ]:
df['Gender'] = df['Gender'].str.capitalize()
df['City'] = df['City'].str.strip()
df['Hire Date'] = pd.to_datetime(df['Hire Date'])

In [97]:
df['Job Title'] = df['Job Title'].str.replace('\xa0', ' ', regex=False).str.strip()
df['Job Title'] = df['Job Title'].str.capitalize()
df['Job Title'] = df['Job Title'].replace({
    'Sr. Manger': 'Senior Manager',  
    'System AdministratorÂ ': 'System Administrator',  
    'It ': 'IT '  
}, regex=True)

In [45]:
print(df['Business Unit'].isna().sum())
df.dropna(subset=['Business Unit'],inplace = True)
print(df['Business Unit'].isna().sum())

3
0

In [ ]:
df.drop('ExitDate',axis = 1 , inplace = True)

In [91]:
print(df['Full Name'].isna().sum())
df.dropna(subset=['Full Name'],inplace = True)
print(df['City'].isna().sum())

1
0

In [99]:
df.info

<bound method DataFrame.info of        EEID      Full Name             Job Title Department  \
0    E03247    Aaliyah Mai        Vice president         IT
1    E04888   Elijah Henry               Manager         IT
2    E02216  Caleb Marquez  IT systems architect         IT
3    E02861   Daniel Perry  Enterprise architect         IT
4    E04972      Sophie Oh      Network engineer         IT
..      ...            ...                   ...        ...
274  E04444  Brooklyn Ruiz        IT coordinator         IT
275  E04189     Ariana Kim     Network architect         IT
276  E03455    Hadley Ford       Systems analyst         IT
277  E04670       Angel Do  IT systems architect         IT
278  E02888   Elijah Ramos            Sr. manger         IT

              Business Unit  Gender  Ethnicity  Age   Hire Date  \
0       Speciality Products  Female      Asian   57  2016-11-11
1                 Corporate    Male  Caucasian   32  2014-01-03
2    Research & Development    Male     Latino   29  2019-10-15
3    Research & Development    Male  Caucasian   62  2001-04-15
4                 Corporate  Female      Asian   29  2017-11-09
..                      ...     ...        ...  ...         ...
274           Manufacturing  Female     Latino   61  2014-08-10
275           Manufacturing  Female      Asian   33  2014-06-29
276  Research & Development  Female  Caucasian   52  2005-02-23
277     Speciality Products    Male      Asian   34  2019-09-20
278     Speciality Products    Male     Latino   33  2012-12-24

     Annual Salary  Bonus %        Country            City  EmploymentRating  \
0         246589.0     0.33  United States         Phoenix                 7
1         127148.0     0.10  United States           Miami                 7
2          66819.0     0.00         Brazil  Rio de Janerio                 7
3          80921.0     0.00  United States        Columbus                 5
4          63985.0     0.00  United States           Miami                 8
..             ...      ...            ...             ...               ...
274        57446.0     0.00  United States         Phoenix                 6
275        96366.0     0.00          China         Chengdu                 6
276        45286.0     0.00  United States         Chicago                 9
277        94735.0     0.00          China       Beijing                  10
278       132544.0     0.10         Brazil  Rio de Janerio                 9

     DaysOfAbsence EducationLevel  CertificationsEarned
0               16     Bachelor's                     0
1               16       Master's                     1
2               16     Bachelor's                     2
3               16     Bachelor's                     1
4               16     Bachelor's                     3
..             ...            ...                   ...
274              0     Bachelor's                     4
275              0     Bachelor's                     0
276              0       Master's                     0
277              0            PhD                     3
278              0     Bachelor's                     2

[231 rows x 17 columns]>

In [83]:
df['Hire Date']=pd.to_datetime(df['Hire Date'],format = 'mixed').dt.date

In [101]:
df.to_csv('ITcleaned1.csv', index=False)